---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FaceroofOffsetParam
source: html/afdc7a2c-a843-6ab4-2c62-92b092c54960.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FaceroofOffsetParam Property

"Level Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId FaceroofOffsetParam { get; }
```